
{
  "title":"Lecture Notes",
  "content":" Abbreviations TE = thermal equilibrium\nMOS = metal-on-silicon\nMOSFET = metal-oxide-semiconductor field-effect transistor\nBJT = bipolar junction transistor\nCMOS = complementary metal-oxide-semiconductor\nCS = common source\nOCTC = open circuit time constant\nLEC # TOPICS SLIDES ADDITIONAL NOTES 1 Introduction to semiconductors, doping, generation/recombination, TE carrier concentrations. Carrier dynamics and transport: drift. (PDF) 2 Excess populations and minimum carrier lifetime, photoconductivity. Non-uniform concentrations and diffusion. Fick\u0026rsquo;s first and second laws. (PDF) 3 The five basic equations. Device structures in TE: carriers and electrostatic potential; the 60 mV rule. Poisson\u0026rsquo;s equation (PE). (PDF) Solving the five equations (PDF)\nPhotoconductors (PDF)\n4 P-n junctions in thermal equilibrium and under reverse bias, the depletion approximation (DA), comparison to PE solution. (PDF) 5 Review reverse biased junctions. Consider forward bias and the special case of minority carrier injection into quasineutral regions. (PDF) 6 Forward biased p-n junctions: carrier injection, i-v characteristics (ideal and real; forward and reverse). Engineering carrier injection. (PDF) 7 Bipolar junction transistors: two coupled diodes, terminal characteristics, regions of operation (PDF) 8 Solar cells and LEDs (light emitting diodes). (PDF) 9 MOS capacitors: the DA applied to two-terminal MOS capacitor accumulation, depletion, and inversion; VFB, VT, QA, and QN (PDF) 10 The three-terminal MOS capacitor. MOSFETs: begin gradual channel approximation (GCA) using DA and ignoring subthreshold carriers. (PDF) CCD Nobel Prize slides (PDF) 11 Complete GC/DA model for iDS: saturation, channel length modulation. Output characteristics; regions of operation. (PDF) Drain current model (PDF)\nGradual channel approximation for MOSFETs (PDF)\n12 Subthreshold operation of MOSFETs. Development of model; compare to full numerical solution. Compare to/contrast with BJTs. (PDF - 1.0MB) Sub-threshold modeling notes (PDF - 1.1MB) 13 Linear equivalent circuits for MOSFETs and BJTs at low and high frequency; transconductance of subthreshold MOSFETs. (PDF) 14 Logic inverter basics. Introduction to CMOS: transfer characteristics, noise margins, optimal device sizing. (PDF) Inverter analysis and design (PDF)\nAnalysis of inverter switching delays (PDF)\n15 CMOS analysis, continued: switching delays, power dissipation, speed/power trade-offs. (PDF) Analysis of CMOS gate delay and power (PDF) 16 CMOS analysis, continued: subthreshold leakage, scaling rules, and where it is all going. (PDF) CMOS scaling and power dissipation (PDF)\nCMOS scaling: comparing 1970 and 2000 (PDF)\n17 Linear amplifier basics: performance metrics, current source biasing, current mirrors, mid-band range, two-port representation. (PDF) 18 Single-transistor building block stages: common-source, common-gate, and common-drain (follower) stages; characteristics and features. (PDF) 19 Differential amplifiers: large signal transfer characteristics; small signal analysis using common- and difference-mode inputs. (PDF) 20 Multi-stage amplifiers I: cascading diff stages; current source biasing; output stages. (PDF) Active loads: current mirror load, Lee load (PDF) 21 Multi-stage amplifiers II: active loads, biasing for maximum gain, input and output swings. (PDF) The marvelous cascode (PDF) 22 Multi-stage amplifiers III: examples, stage selection, speciality stages, looking at a commercial op-amp schematic. Begin frequency response. (PDF - 1.1MB) 23 Frequency response of CS amplifiers, the Miller effect. Intrinsic frequency limitations of MOSFETs. Biasing to maximize speed, power trade-off. (PDF) 24 OCTC method for estimating frequency response. Subthreshold amplifiers for ultra-lower power electronics, frequency performance. (PDF - 1.1MB) 25 MOS imagers. Semester wrap-up; life after 6.012. (PDF) "}


